#### BuiltInFailures.MEPFabricationFailures Members

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures MEPFabricationFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AdditionalPartNotLoaded | An additional part was not loaded. |
| Public property Static member | CannotConvertFlexPipeToPart | Cannot convert flex pipe to fabrication part. |
| Public property Static member | CannotMatchFabricationHangerSizeToHost | The hanger cannot be re-sized to match the re-sized host. |
| Public property Static member | FabDbChangeConn | Fabrication Database changes altered connectivity |
| Public property Static member | FabDbOpenJobConn | Fabrication job imported had bad connectivity |
| Public property Static member | FabDbSwapOut | Fabrication Database reload could not swap out for newer parts. |
| Public property Static member | FabricationConfigurationCorrupted | It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!. |
| Public property Static member | FabricationHangerCannotBeSloped | A hanger cannot be sloped or placed on a sloped element. |
| Public property Static member | FabricationHangerHostNotFound | The hanger will disconnect because we can't find the suitable host. |
| Public property Static member | FabricationHangerNotConnectToHost | Fabrication Hanger didn't connect to the %s host. |
| Public property Static member | FabricationHangerOutOfHost | The hanger is out of its host and will be disconnected. |
| Public property Static member | FabricationHangerSizeNotMatch | The hanger size does not match the size of the host, so it can not be connected. |
| Public property Static member | FabricationOutOfSizeCondition | The fabrication part size is not within the correct size range for the service button condition. |
| Public property Static member | FabricationOverSizedCheck | Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator. |
| Public property Static member | FabricationPartCannotBeMirrored |  |
| Public property Static member | FabricationPartCannotChangeServiceSizeWarning | The selected fitting(s) cannot successfully change service or change size. You must disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeSlopeError | The connected fitting(s) cannot successfully change to the new slope value. You may try to disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeTypeBadDimError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions or be constrained due to connected fitting(s). You may try to disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeTypeBadDimUnConnError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions, resulting in bad geometry. |
| Public property Static member | FabricationPartCannotChangeTypeError | The selected fitting(s) cannot successfully change the type. You must disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeTypeIncompatError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeTypeIncompatUnConnError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. |
| Public property Static member | FabricationPartCannotChangeTypeMisalignedError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again. |
| Public property Static member | FabricationPartCannotChangeTypeMisalignedUnConnError | The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry. |
| Public property Static member | FabricationPartCannotChangeTypeUnConnError | The selected fitting(s) cannot successfully change the type. |
| Public property Static member | FabricationPartCannotChangeTypeWarning | The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections. |
| Public property Static member | FabricationPartExceededAngleFlexToleranceWarning | The angle flex is greater than the maximum angle flex tolerance defined by the fabrication part. Connections with this part may not be properly aligned and may appear to be skewed. |
| Public property Static member | FabricationPartExcludedPartWarning | There were fabrication parts needed to the make the connection that were excluded from the fabrication service causing the connection to fail. You may try to inlcude these fitting(s) and try again. |
| Public property Static member | FabricationPartFitFailure | Fabrication Part Fitting Failed to Fit |
| Public property Static member | FabricationPartFitFailWarning | Fabrication Part Fitting Failed to Fit |
| Public property Static member | FabricationPartHasInvalidGeometry | The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry. |
| Public property Static member | FabricationPartInvalidConnection | Fabrication Part connection invalid and could not be automatically coupled. |
| Public property Static member | FabricationPartInvalidSpecification | The part specification is invalid. |
| Public property Static member | FabricationPartNoPartTypeFound | There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types. |
| Public property Static member | FabricationPartNotAttachedToStraight | The part must be attached to straight. |
| Public property Static member | FabricationPartOptimizeInvalidConnection | No available couplings to connect standard lengths for this instance of straight. |
| Public property Static member | FabricationRodDetachFromHangerError | The rod need to be detached from hanger. |
| Public property Static member | FabricationRodsConnectionChangedWarning | The structural component that the hanger is attached to has changed to a different element. |
| Public property Static member | FabricationRodsDisconnectedError | The hanger rod was disconnected because there is no structural component above. |
| Public property Static member | FabricationRodsDisconnectedWarning | The hanger rod was disconnected because there is no structural component above. |
| Public property Static member | FabricationServiceMismatch | Attempting to connect fabrication parts from different services. |
| Public property Static member | FabricationStraigtLengthOversized | Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length. |
| Public property Static member | FixedFabricationPartNotChangeLength | Failed to change length of fixed part. |
| Public property Static member | GroupedFabricationPartNotReposition | Failed to reposition part. |
| Public property Static member | HangerProfileNotMatchWithHost | The defined hanger profile does not match with the host. |
| Public property Static member | HangerWidthOutOfRange | The hanger width is too large to show. |
| Public property Static member | InvalidConnectionsHaveBeenDisconnected | Invalid connections have been disconnected. Please reconnect them manually or use different fittings. |
| Public property Static member | InvalidSelectionThereCannotBeOpenConnectors | Invalid selection there cannot be any open connectors for the design to fabrication part tool. |
| Public property Static member | NoStructuralHostToAttachWarning | There is no structural component to attach the hanger rod to. |
| Public property Static member | NotAllPartsWereConvertedUnsuportedFittingOffsets | Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted. |
| Public property Static member | PinnedFabricationPartNotChangeExtension | Failed to change extension of part. |
| Public property Static member | PinnedFabricationPartNotReposition | Failed to reposition part. |
| Public property Static member | PlaceCutinFittingFailed | Failed to insert part. |
| Public property Static member | SizeNotAvailableInFabricationService | Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!. |
| Public property Static member | UneditableFabricationPartNotReposition | Failed to reposition part. |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace